src/Catalogs/ВК_ИдентификаторыПредопределенныхЗначений/ВК_ИдентификаторыПредопределенныхЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВК_ИдентификаторыПредопределенныхЗначений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДанныеДляИнтеграции</name>
      <description>Данные для интеграции</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/InformationRegisters/ВК_ЗначенияИдентификаторовПредопределенныхЗначений/ВК_ЗначенияИдентификаторовПредопределенныхЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВК_ЗначенияИдентификаторовПредопределенныхЗначений</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.ВК_ИдентификаторыПредопределенныхЗначений</types>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>CatalogRef.ВК_ИдентификаторыПредопределенныхЗначений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>CatalogRef.ВК_ИдентификаторыПредопределенныхЗначений</types>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ВК_ИдентификаторыПредопределенныхЗначений/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьТаблицуПараметров();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьИдентификаторыПредопределенныхЭлементов(ТекущийОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуПараметров()

	Запрос = Новый Запрос();

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияИдентификаторовПредопределенныхЗначений.Параметр,
	|	ЗначенияИдентификаторовПредопределенныхЗначений.Значение
	|ИЗ
	|	РегистрСведений.ВК_ЗначенияИдентификаторовПредопределенныхЗначений КАК ЗначенияИдентификаторовПредопределенныхЗначений
	|ГДЕ
	|	ЗначенияИдентификаторовПредопределенныхЗначений.Идентификатор = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаПараметров.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторыПредопределенныхЭлементов(ТекущийОбъект)

	НаборЗаписей = РегистрыСведений.ВК_ЗначенияИдентификаторовПредопределенныхЗначений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();

	НаборЗаписей.Очистить();

	Для Каждого Стр Из ТаблицаПараметров Цикл

		Запись = НаборЗаписей.Добавить();
		Запись.Идентификатор = Объект.Ссылка;

		ЗаполнитьЗначенияСвойств(Запись, Стр);

	КонецЦикла;

	НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецОбласти
